Code-quiz/app/Http/Controllers/RegisterController.php

    public function __invoke(Request $request)
    {
        //
        $this->validate($request, [
            'name' => 'required|string',
            'email' => 'required|string|min:10',
            'password' => 'required',
        ]);
        $user = User::create([
            "name" => $request->input('name'),
            "email" => $request->input('email'),
            "password" => Hash::make($request->input('password')),

        ]);
---
INSERT INTO `users` (`name`, `email`, `password`, `updated_at`, `created_at`) VALUES ('roffe', 'egon@gmail.com', 'y$pbF4vG4lAnLzC6PXV7vS0usTe.0web5F/VaHI9M5SA.MRC4TEFYWy', '2021-04-09 15:06:18', '2021-04-09 15:06:18')